In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
data = pd.DataFrame({"state":["ohio","ohio","ohio","nevada","nevada","nevada"],
                    "year":[2000,2001,2002,2001,2002,2003],
                    "pop":[1.5,1.7,3.6,2.4,2.9,3.2],})
data

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9
5  nevada  2003  3.2

In [7]:
pd.DataFrame(data)
#,columns=["year","state","pop"]

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9
5  nevada  2003  3.2

In [6]:
data2 = pd.DataFrame(data,columns = ["year","state","pop","debt"])
data2

   year   state  pop  debt
0  2000    ohio  1.5   NaN
1  2001    ohio  1.7   NaN
2  2002    ohio  3.6   NaN
3  2001  nevada  2.4   NaN
4  2002  nevada  2.9   NaN
5  2003  nevada  3.2   NaN

In [7]:
data2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [18]:
data["state"]

0      ohio
1      ohio
2      ohio
3    nevada
4    nevada
5    nevada
Name: state, dtype: object

In [8]:
data2=pd.DataFrame(data,columns=["state","year","pop","debt"])
data2

    state  year  pop  debt
0    ohio  2000  1.5   NaN
1    ohio  2001  1.7   NaN
2    ohio  2002  3.6   NaN
3  nevada  2001  2.4   NaN
4  nevada  2002  2.9   NaN
5  nevada  2003  3.2   NaN

In [10]:
data2["state"]

0      ohio
1      ohio
2      ohio
3    nevada
4    nevada
5    nevada
Name: state, dtype: object

In [11]:
data2["debt"]=np.arange(6)
data2

    state  year  pop  debt
0    ohio  2000  1.5     0
1    ohio  2001  1.7     1
2    ohio  2002  3.6     2
3  nevada  2001  2.4     3
4  nevada  2002  2.9     4
5  nevada  2003  3.2     5